# Дан список интов,повторяющихся элементов в списке нет.
# Нужно преобразовать этомножество в строку,сворачивая соседние по числовому ряду числа в диапазоны.
#  Примеры:[1,4,5,2,3,9,8,11,0] => "0-5,8-9,11" [1,4,3,2] => "1-4"[1,4] => "1,4"

a = sorted(set([1,4,2,5,3,9,8,11,0,14,13]))
print(a)
count = 0
for i in range(1,len(a)):
    if a[i] == a[i-1]+1:
        count +=1
    else:
        if count == 0:
            print(f'({a[i-1]})', end='')
        else:
            print(f'({a[(i-1)-count]}-{a[i-1]})', end='')
            count = 0
    if i == len(a)-1:
        if count == 0:
            print(f'({a[i]})', end='')
        else:
            print(f'({a[i-count]}-{a[i]})')